Tekla Open API Reference for Tekla Structures 2025
Mark Properties
The Mark type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from MarkBase.)
InsertionPoint
 The insertion point of the mark.
 (Inherited from MarkBase.)
IsAssociativeNote
 Gets a value indicating whether the mark is an associative note.
 (Inherited from MarkBase.)
Placing
 The current placing of the object. See the placing types for different placing options.
 (Inherited from MarkBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace